9/data/attachments/34c9327f29bbfca5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Melinda_raise_Friend_49387_8</nif:username>
            <nif:friendToBeRequested>soap_friends_e14a244b-93c0-48b8-8d81-c113e96e4042</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>